# Agenda: Real-world

1. Recap and Q&A
2. More about CSV
3. Sorting with data
4. Grouping
5. Pivot tables
6. Joining
7. Cleaning

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
df = DataFrame([[10, 20, 30, 40],
                [50, 60, 70, 80]],
               index=list('ab'),
               columns=list('wxyz'))

In [5]:
df

    w   x   y   z
a  10  20  30  40
b  50  60  70  80

In [9]:
# retrieve an entire row, use .loc

df.loc['b']     # this retrieves a row

w    50
x    60
y    70
z    80
Name: b, dtype: int64

In [10]:
df['x']    # this retrieves a column

a    20
b    60
Name: x, dtype: int64

In [11]:
df['y']   # so does this

a    30
b    70
Name: y, dtype: int64

In [12]:
# row selectors and column selectors with .loc

df.loc['b', 'y']  # row b and column y

70

In [13]:
# I want all of the elements from row b, columns x and y

df.loc['b', ['x', 'y']]

x    60
y    70
Name: b, dtype: int64

In [14]:
df

    w   x   y   z
a  10  20  30  40
b  50  60  70  80

In [15]:
df['w'] > 30

a    False
b     True
Name: w, dtype: bool

In [17]:
# wherever w is greater than 30,
# we want to see columns x and z

df.loc[
    df['w'] > 30,   # row selector -- a boolean series, which will act as a mask index
    ['x', 'z']       
    ]

    x   z
b  60  80

In [19]:
df = pd.read_csv('taxi.csv')
df.head()   # shows us the first five rows

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [21]:
df = pd.read_csv('taxi.csv', usecols=['passenger_count', 'trip_distance', 'total_amount'])
df.head()   # shows us the first five rows

   passenger_count  trip_distance  total_amount
0                1           1.63         17.80
1                1           0.46          8.30
2                1           0.87         11.00
3                1           2.13         17.16
4                1           1.40         10.30

In [23]:
# show me how much, on average, people paid and how far they traveled when the number of passengers was
# greater than 2

df.loc[
    df['passenger_count'] > 2,  # row selector 
    ['trip_distance', 'total_amount']  # column selector
].mean()

trip_distance     3.278653
total_amount     17.679939
dtype: float64

In [26]:
df = pd.read_csv('taxi.csv', header=None,
                usecols=[3, 4])  # the first row is *not* considered to be the headers (column names)

In [27]:
df.head()

                 3              4
0  passenger_count  trip_distance
1                1           1.63
2                1            .46
3                1            .87
4                1           2.13

In [29]:
df = pd.read_csv('taxi.csv', header=None,
                usecols=[3, 4],
                names=['count', 'distance'])  # the first row is *not* considered to be the headers (column names)

In [30]:
df

                count       distance
0     passenger_count  trip_distance
1                   1           1.63
2                   1            .46
3                   1            .87
4                   1           2.13
...               ...            ...
9995                1           2.70
9996                1           4.50
9997                1           5.59
9998                6           1.54
9999                1           5.80

[10000 rows x 2 columns]

In [31]:
# get all values in df other than those in row 0
df = df[1:]

In [32]:
df

     count distance
1        1     1.63
2        1      .46
3        1      .87
4        1     2.13
5        1     1.40
...    ...      ...
9995     1     2.70
9996     1     4.50
9997     1     5.59
9998     6     1.54
9999     1     5.80

[9999 rows x 2 columns]

In [33]:
# what happens if I now ask for the mean values of these two columns?
df.mean()

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_7275/2498805070.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

count    inf
dtype: float64

In [34]:
df.dtypes  # what dtypes do we have in these two columns

count       object
distance    object
dtype: object

In [36]:
df['count'] = df.loc['count'].astype(np.int64)
df['distance'] = df.loc['distance'].astype(np.float64)

KeyError: 'count'

In [37]:
df.head()

   count  distance
1      1      1.63
2      1      0.46
3      1      0.87
4      1      2.13
5      1      1.40

In [38]:
df.dtypes

count         int64
distance    float64
dtype: object

In [39]:
df = pd.read_csv('AAPL.csv')

In [40]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-04-09,169.880005,173.089996,169.850006,170.050003,170.050003,29017700
1,2018-04-10,173.000000,174.000000,171.529999,173.250000,173.250000,28408600
2,2018-04-11,172.229996,173.919998,171.699997,172.440002,172.440002,22431600
3,2018-04-12,173.410004,175.000000,173.039993,174.139999,174.139999,22889300
4,2018-04-13,174.779999,175.839996,173.850006,174.729996,174.729996,25124300

In [41]:
df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [43]:
# set the index of the data frame to be the Date column from the input CSV
df = pd.read_csv('AAPL.csv', index_col='Date')

In [44]:
df

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2018-04-09,169.880005,173.089996,169.850006,170.050003,170.050003,29017700
2018-04-10,173.000000,174.000000,171.529999,173.250000,173.250000,28408600
2018-04-11,172.229996,173.919998,171.699997,172.440002,172.440002,22431600
2018-04-12,173.410004,175.000000,173.039993,174.139999,174.139999,22889300
2018-04-13,174.779999,175.839996,173.850006,174.729996,174.729996,25124300
2018-04-16,175.029999,176.190002,174.830002,175.820007,175.820007,21578400
2018-04-17,176.490005,178.940002,176.410004,178.240005,178.240005,26605400
2018-04-18,177.809998,178.820007,176.880005,177.839996,177.839996,20754500
2018-04-19,173.759995,175.389999,172.660004,172.800003,172.800003,34808800
2018-04-20,170.600006,171.220001,165.429993,165.720001,165.720001,65491100
2018-04-23,166.830002,166.919998,164.089996,165.240005,165.240005,36515500
2018-04-24,165.669998,166.330002,161.220001,162.940002,162.940002,33692000
2018-04-25,162.619995,165.419998,162.410004,163.649994,163.649994,28382100
2018-04-26,164.119995,165.729996,163.369995,164.220001,164.220001,27963000
2018-04-27,164.000000,164.330002,160.630005,162.320007,162.320007,35655800
2018-04-30,162.130005,167.259995,161.839996,165.259995,165.259995,42427400
2018-05-01,166.410004,169.199997,165.270004,169.100006,169.100006,53569400
2018-05-02,175.229996,177.750000,173.800003,176.570007,176.570007,66539400
2018-05-03,175.880005,177.500000,174.440002,176.889999,176.889999,34068200
2018-05-04,178.250000,184.250000,178.169998,183.830002,183.830002,56201300
2018-05-07,185.179993,187.669998,184.750000,185.160004,185.160004,42451400
2018-05-08,184.990005,186.220001,183.669998,186.050003,186.050003,28030400

In [45]:
df.loc['2018-05-07']

Open         1.851800e+02
High         1.876700e+02
Low          1.847500e+02
Close        1.851600e+02
Adj Close    1.851600e+02
Volume       4.245140e+07
Name: 2018-05-07, dtype: float64

In [46]:
# I can give read_csv  a URL!

pd.read_csv('https://gist.githubusercontent.com/reuven/361d2c2b12dab426f4ed4efb396c89e5/raw/744dc0e9b193b53e3f76712cdfa32fa443440594/AAPL.csv')

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-04-09,169.880005,173.089996,169.850006,170.050003,170.050003,29017700
1,2018-04-10,173.000000,174.000000,171.529999,173.250000,173.250000,28408600
2,2018-04-11,172.229996,173.919998,171.699997,172.440002,172.440002,22431600
3,2018-04-12,173.410004,175.000000,173.039993,174.139999,174.139999,22889300
4,2018-04-13,174.779999,175.839996,173.850006,174.729996,174.729996,25124300
5,2018-04-16,175.029999,176.190002,174.830002,175.820007,175.820007,21578400
6,2018-04-17,176.490005,178.940002,176.410004,178.240005,178.240005,26605400
7,2018-04-18,177.809998,178.820007,176.880005,177.839996,177.839996,20754500
8,2018-04-19,173.759995,175.389999,172.660004,172.800003,172.800003,34808800
9,2018-04-20,170.600006,171.220001,165.429993,165.720001,165.720001,65491100
10,2018-04-23,166.830002,166.919998,164.089996,165.240005,165.240005,36515500
11,2018-04-24,165.669998,166.330002,161.220001,162.940002,162.940002,33692000
12,2018-04-25,162.619995,165.419998,162.410004,163.649994,163.649994,28382100
13,2018-04-26,164.119995,165.729996,163.369995,164.220001,164.220001,27963000
14,2018-04-27,164.000000,164.330002,160.630005,162.320007,162.320007,35655800
15,2018-04-30,162.130005,167.259995,161.839996,165.259995,165.259995,42427400
16,2018-05-01,166.410004,169.199997,165.270004,169.100006,169.100006,53569400
17,2018-05-02,175.229996,177.750000,173.800003,176.570007,176.570007,66539400
18,2018-05-03,175.880005,177.500000,174.440002,176.889999,176.889999,34068200
19,2018-05-04,178.250000,184.250000,178.169998,183.830002,183.830002,56201300
20,2018-05-07,185.179993,187.669998,184.750000,185.160004,185.160004,42451400
21,2018-05-08,184.990005,186.220001,183.669998,186.050003,186.050003,28030400

In [47]:
#  we can choose columns, using usecols

pd.read_csv('https://gist.githubusercontent.com/reuven/361d2c2b12dab426f4ed4efb396c89e5/raw/744dc0e9b193b53e3f76712cdfa32fa443440594/AAPL.csv',
           usecols=['Open', 'Close'])

          Open       Close
0   169.880005  170.050003
1   173.000000  173.250000
2   172.229996  172.440002
3   173.410004  174.139999
4   174.779999  174.729996
5   175.029999  175.820007
6   176.490005  178.240005
7   177.809998  177.839996
8   173.759995  172.800003
9   170.600006  165.720001
10  166.830002  165.240005
11  165.669998  162.940002
12  162.619995  163.649994
13  164.119995  164.220001
14  164.000000  162.320007
15  162.130005  165.259995
16  166.410004  169.100006
17  175.229996  176.570007
18  175.880005  176.889999
19  178.250000  183.830002
20  185.179993  185.160004
21  184.990005  186.050003

#